Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Comment>Флаг активности пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Местонахождение группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
					<Comment>Учетная запись информационной базы с которой олицетворен пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПараметр</Name>
					<Comment>Параметр аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Comment>Тип аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Comment>Используется в бизнес-процессе "Обратная связь лояльности" для постановки и отбора задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииПоказыватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
					<Comment>Полномочия пользователя</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
					<Comment>Целевые точки, которые доступны дополнительно, не зависимо от достуных подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбщиеОчереди</Name>
					<Comment>Очереди, не привязанные к целевым точкам, но включающие агентов целевых звонков (общие очереди)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АгентыЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АгентыЦелевые</Name>
			<Comment>Реестр агентов все звонки которым считаются целевыми</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаЦелевая</Name>
					<Comment>Точка для которой оператор является целевым</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачБлокировки</Name>
					<Comment>Дата и время начала блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонБлокировки</Name>
					<Comment>Дата и время окончания блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстБлокировки</Name>
					<Comment>Причина блокировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИницаторБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВизитнаяКарточка</Name>
					<Comment>Текст визитной карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеБлокироватьЗаЗвонкиОжидающиеОбработкиБолееСуток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Внутренний целевой телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыПривязка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыПривязка</Name>
			<Comment>Привязка объектов к элементам предприятия</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Comment>Владелец объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелМобильные</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Обработка предопределенного объекта
// Убедимся в том что объект не деактивирован
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.Предопределенный = Истина) И (ЭтотОбъект.Активность = Ложь) Тогда
		ТекстСообщения = "Пользователь с наименованием """ + СокрЛП(ЭтотОбъект.Наименование);
		ТекстСообщения = ТекстСообщения + """ является предопределенным. Деактивация запрещена";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Если текущий объект деактивирован, то отключим проверку некоторых реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.Активность = Ложь) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("АутентификацияПараметр"));
		ЭтотОбъект.АутентификацияСтандартная = Истина;

// Если текущий объект активен, то нормализуем некоторые реквизиты
//-------------------------------------------------------------------------------------------------
	Иначе
		ЭтотОбъект.АутентификацияПараметр = СокрЛП(ЭтотОбъект.АутентификацияПараметр);
		ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);

// Проверим на дублирование по Наименованию
//-------------------------------------------------------------------------------------------------
		ТекстЗапроса = "
		|SELECT	COUNT(*) AS Всего
		|FROM	Справочник.Пользователи
		|WHERE	(Ссылка <> &ЭтотОбъект) И (Наименование = &Наименование)";

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ЭтотОбъект",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Наименование);
		Результат = Запрос.Выполнить().Выбрать();

		Если (Результат.Следующий()) И (Результат.Всего > 0) Тогда
			ТекстСообщения = "Пользователь с наименованием """ + СокрЛП(ЭтотОбъект.Наименование);
			ТекстСообщения = ТекстСообщения + """ уже существует в справочнике пользователей";
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

// Сформируем реквизит "УчетнаяЗаписьИБ"
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.Предопределенный = Истина) Тогда
		ЭтотОбъект.УчетнаяЗаписьИБ = СокрЛП(ЭтотОбъект.ИмяПредопределенныхДанных);
	ИначеЕсли (ЭтотОбъект.Активность = Истина) Тогда
		ЭтотОбъект.УчетнаяЗаписьИБ = СокрЛП(ЭтотОбъект.Наименование);
	Иначе
		ЭтотОбъект.УчетнаяЗаписьИБ = "";
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Обработаем создание, корректировку или удаление пользователя информационной базы
	// Обработаем ситуацию при которой учетная запись пользователя ИБ требует удаления
	//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(ЭтотОбъект.Ссылка) И (ЭтотОбъект.Предопределенный = Ложь)) Тогда
		СтарИмя = ВРег(СокрЛП(ЭтотОбъект.Ссылка.УчетнаяЗаписьИБ));
		НовИмя = ВРег(СокрЛП(ЭтотОбъект.УчетнаяЗаписьИБ));
		
		Если (СтарИмя <> НовИмя) Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ЭтотОбъект.Ссылка.УчетнаяЗаписьИБ));
			
			Если (ПользовательИБ <> Неопределено) Тогда
				ПользовательИБ.Удалить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Если реквизит "УчетнаяЗаписьИБ" не заполнен (объект деактивирован)
	//-------------------------------------------------------------------------------------------------
	Если (НЕ ЗначениеЗаполнено(ЭтотОбъект.УчетнаяЗаписьИБ)) Тогда
		Возврат;
	КонецЕсли;
	
	// Найдем пользователя ИБ с учетной записью, заданной в объекте. Если не найдем, то создадим нового
	//-------------------------------------------------------------------------------------------------
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ЭтотОбъект.УчетнаяЗаписьИБ));
	
	Если (ПользовательИБ = Неопределено) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	// Выполним корректировку основных реквизитов
	//-------------------------------------------------------------------------------------------------
	ПользовательИБ.ПолноеИмя = СокрЛП(ЭтотОбъект.Наименование);
	ПользовательИБ.Имя = СокрЛП(ЭтотОбъект.УчетнаяЗаписьИБ);
	ПользовательИБ.Язык = Метаданные.Языки.Русский;
	
	// Настроим реквизиты отвечающие за авторизацию
	//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.АутентификацияСтандартная = Истина) Тогда
		ПользовательИБ.Пароль = СокрЛП(ЭтотОбъект.АутентификацияПараметр);
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
		ПользовательИБ.ЗапрещеноИзменятьПароль = Ложь;
		ПользовательИБ.АутентификацияОС = Ложь;
		ПользовательИБ.ПользовательОС = "";
	Иначе
		ПользовательИБ.ПользовательОС = СокрЛП(ЭтотОбъект.АутентификацияПараметр);
		ПользовательИБ.АутентификацияСтандартная = Ложь;
		ПользовательИБ.ЗапрещеноИзменятьПароль = Истина;
		ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
		ПользовательИБ.АутентификацияОС = Истина;
		ПользовательИБ.Пароль = "";
	КонецЕсли;
	
	// Если в структуре "ДополнительныеСвойства" передана информация о наборе ролей, то скорректируем
	// набор ролей пользователя информационной базы
	//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ДополнительныеСвойства.Свойство("Роли") = Истина) Тогда
		СписокРолей = СтрЗаменить(ЭтотОбъект.ДополнительныеСвойства.Роли,",",Символы.ПС);
		ПользовательИБ.Роли.Очистить();
		
		Для ТекСтрока = 1 По СтрЧислоСтрок(СписокРолей) Цикл
			ИмяРоли = СокрЛП(СтрПолучитьСтроку(СписокРолей,ТекСтрока));
			Попытка ПользовательИБ.Роли.Добавить(Метаданные.Роли[ИмяРоли]); Исключение КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	//Доступные целевые точки сформируй
	//----------------------------------
	СформируйДоступныеЦелевыеТочки();
		
	// Выполним запись пользователя информационной базы
	//-------------------------------------------------------------------------------------------------
	Попытка
		ПользовательИБ.Записать();
	Исключение
		ТекстСообщения = "При записи пользователя информационной базы с именем [" + СокрЛП(ЭтотОбъект.Наименование);
		ТекстСообщения = ТекстСообщения + "] произошла ошибка: " + СокрЛП(ОписаниеОшибки());
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

Процедура СформируйДоступныеЦелевыеТочки()
	
	ДоступныеЦелевыеТочки.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Рег.ТочкаЦелевая КАК Ссылка
	|ИЗ
	|	РегистрСведений.АгентыЦелевые КАК Рег
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыПривязка КАК Прив
	|		ПО (Прив.Владелец В ИЕРАРХИИ (&Подразделения))
	|			И (Прив.Объект = Рег.Телефон)";

	Запрос.УстановитьПараметр("Подразделения",ЭтотОбъект.Подразделения.ВыгрузитьКолонку("Подразделение"));

	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Новая = ДоступныеЦелевыеТочки.Добавить();
		Новая.ЦелеваяТочка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры
